<?php

// for文
// -----------------------------
// for($i=1 ; $i<=5 ; $i++){
//     echo $i*2 . '<br />';
// }
// -----------------------------

// while文
// -----------------------------
// $count = 0 ;

// while($count <= 100){
//     if($count==20){
//         break;
//     }elseif($count % 3 ==0){
//         $count += 1 ;
//         continue ;
//     }
//     echo $count . '<br />' ;
//     $count += 1 ;
// }
// -----------------------------

// do...while文
// -----------------------------
// $nume = 0 ;

// do {
//     echo 'num = ' . $nume . '<br />' ;
//     $nume++ ;
// } while ($nume < 3 ) ;
// -----------------------------

// 応用問題1（FizzBuzz問題）
// -----------------------------
// $Fizz = 'Fizz' ;
// $Buzz = 'Buzz' ;
// $FizzBuzz = 'FizzBuzz' ;

// for ($i=1 ; $i<=50 ; $i++) {
//     if ($i % 3 == 0 && $i % 5 == 0) {
//         echo $FizzBuzz . '<br />' ;
//     } elseif ($i % 3 == 0) {
//         echo $Fizz . '<br />' ;
//     } elseif ($i % 5 == 0) {
//         echo $Buzz . '<br />' ;
//     } else {
//         echo $i . '<br />';
//     }
// }
// -----------------------------

// 応用問題(二重ループ)個人作成
// -----------------------------
// $Culnum = 0 ;
// $Rownum = 0 ;
// $Loop = "●" ;

// do {
//     do {
//         echo $Loop ;
//         $Culnum++ ;
//         if ($Culnum % 5 == 0){
//             echo '<br />' ;
//         }
//     } while( $Culnum <= 20 ) ;

//     $Rownum++ ;
// } while ($Rownum < 5) ;
// -----------------------------

// 応用問題(二重ループ)解答
// -----------------------------
for($i=1;$i<=5;$i++) {
    for($j=1;$j<=5;$j++){
        echo "●";
    }
    echo '<br />' ;
}
// -----------------------------


?>