<?php

// if文
// -----------------------------
// $a = 5 ;

// if($a === 5){
//     echo "\$aは5です" ;
// }

// $a = 7 ;

// if($a === 5){
//     echo "\$aは5です" ;
// }else{
//     echo "\$aは5以外です" ;
// }
// -----------------------------


// switch文
// -----------------------------
// $people = "Saburo";

// switch($people){
//     case "Taro":
//         echo "太郎です";
//         break;
//     case "Jiro":
//         echo "次郎です";
//         break;
//     case "Saburo":
//         echo "三郎です";        break;
// }
// -----------------------------


// 三項演算子
// -----------------------------
$a = 7 ;
$b = ($a > 8) ? "TRUE" : "FALSE" ;

echo $b ;
// -----------------------------

?>