<?php

//算術演算子
// -----------------------------
// $a = 15 ;
// $b = 3 ;
// $c = 10 ;

// $answer1 = $a + $b ;
// $answer2 = $a - $b ;
// $answer3 = $a * $b ;
// $answer4 = $a / $b ;
// $answer5 = $a % $c ;

// echo $answer1 ;
// echo "<br />" ;
// echo $answer2 ;
// echo "<br />" ;
// echo $answer3 ;
// echo "<br />" ;
// echo $answer4 ;
// echo "<br />" ;
// echo $answer5 ;
// -----------------------------


// 代入演算子
// -----------------------------
// $a = 15 ;
// $b = 3 ;
// $c = 10 ;
// $d = 5 ;

// $answer1 = $a ;
// $answer1 = $b ;

// $answer2 = $c ;
// $answer2 += $d ;

// echo $answer1 ;
// echo "<br />" ;
// echo $answer2 ;
// -----------------------------

// 比較演算子
// -----------------------------
// $a = 20 ;
// $b = 5 ;

// echo ($a > $b) ;
// -----------------------------

// 論理演算子
// -----------------------------
// $a = 20 ;
// $b = 5 ;

// echo ($a > 10 and $a < 30) ;
// -----------------------------

// 加算子と減算子
// -----------------------------
$a = 10 ;
$b = 10 ;
$c = 5 ;
$d = 5 ;

echo ++$a ;
echo "<br />" ;
echo $b++ ;
echo "<br />" ;
echo --$c ;
echo "<br />" ;
echo $d-- ;
echo "<br />" ;
// -----------------------------


?>